# ConceptualEnergyData Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..ConceptualEnergyData Property
GroupTypeId Class See Also
---
Conceptual Energy Data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId ConceptualEnergyData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConceptualEnergyData As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConceptualEnergyData {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace